[
  {
    "titulo": "Plataforma de Talentos Tech para Mulheres",
    "descricao": "Projeto desenvolvido em Java com Thymeleaf que promove a inclusão e a diversidade no mercado de tecnologia, com foco na valorização da presença feminina. A aplicação permite registrar usuárias e exibir uma lista delas em cards interativos, que ao serem clicados redirecionam para seus perfis no LinkedIn, facilitando a conexão entre mulheres profissionais e oportunidades de trabalho.",
    "github": "devas-job-plataform-java-springboot-thymeleaf-mysql",
    "icone": "fa fa-female",
    "youtubeID": "QRcKssfvLGI",
    "tags": [
      "grafana",
      "prometheus",
      "actuator",
      "thymeleaf",
      "java",
      "mvc",
      "spring-boot",
      "maven",
      "jpa",
      "mysql",
      "hibernate"
    ]
  },
  {
    "titulo": "Sistema de Filas Assíncronas com Spring Boot e RabbitMQ",
    "descricao": "Projeto em Java com Spring Boot que implementa comunicação assíncrona usando RabbitMQ. A aplicação gerencia pedidos enviados para uma fila, processa-os com controle de falhas, incluindo Dead Letter Queue para mensagens não processadas. Ideal para sistemas distribuídos que demandam alta confiabilidade e escalabilidade.",
    "github": "async-order-processing-rabbitmq-producer-consumer-springboot",
    "icone": "fa fa-server",
    "youtubeID": "r5fGtNjcEvc",
    "tags": [
      "java",
      "spring-boot",
      "rabbitmq",
      "asynchronous",
      "message-queue",
      "jpa",
      "retry",
      "dead-letter-queue"
    ]
  },
  {
    "titulo": "Cadastro e Login de usuários com Spring Security",
    "descricao": "Aplicativo web de gerenciamento de usuários desenvolvido com Spring Boot. Ele oferece recursos de registro, autenticação e gerenciamento de contas, incluindo alteração de e-mail e senha, além de exclusão de usuários. O frontend é desenvolvido com Thymeleaf, garantindo integração dinâmica e segura com o backend.",
    "github": "register-login-dashboard-thymeleaf-postgresql",
    "icone": "fa fa-female",
    "youtubeID": "TAWPE7xqqBg",
    "tags": [
      "java",
      "mvc",
      "spring-boot",
      "maven",
      "jpa",
      "postgreql",
      "hibernate",
      "thymeleaf"
    ]
  },
  {
    "titulo": "Sistema de Gestão de Funcionários",
    "descricao": "Projeto de sistema CRUD para gerenciamento de funcionários, desenvolvido com Spring Boot, Feign Client e PostgreSQL. A aplicação expõe uma API RESTful, utilizando JPA e Hibernate para persistência de dados, com foco em boas práticas de desenvolvimento como testes unitários com JUnit 5, Mockito e cobertura de código com JaCoCo. Gerenciado com Maven, o projeto demonstra integração eficaz entre microsserviços e banco de dados relacional.",
    "github": "employee-crud-rest-feign-springboot-postgresql",
    "icone": "fa fa-briefcase",
    "youtubeID": "VMVv14_0Jx0",
    "tags": [
      "java",
      "mvc",
      "continuous-integration",
      "continuous-deployment",
      "github-actions",
      "spring-boot",
      "maven",
      "jpa",
      "rest-api",
      "postgresql",
      "junit-5",
      "mockito",
      "unit-testing",
      "jacoco",
      "hibernate",
      "feign-client"
    ]
  },
  {
    "titulo": "Processamento em Lote de Arquivos Excel",
    "descricao": "Projeto de processamento em lote desenvolvido com Spring Batch para leitura e tratamento de arquivos Excel e CSV, com os dados persistidos em banco de dados MySQL. A aplicação utiliza Java para automação do processamento, garantindo eficiência e escalabilidade na manipulação de grandes volumes de dados.",
    "github": "employee-excel-batch-processing-springboot-mysql",
    "icone": "fa fa-window-restore",
    "youtubeID": "j3mtOBDhNJM",
    "tags": [
      "java",
      "mvc",
      "spring-batch",
      "continuous-integration",
      "continuous-deployment",
      "github-actions",
      "mysql",
      "excel",
      "junit-5",
      "mockito",
      "unit-testing",
      "jacoco"
    ]
  },
  {
    "titulo": "Disclosure - Game 3D stealth em Terceira Pessoa",
    "descricao": "DISCLOSURE foi um jogo que desenvolvi para meu TCC no curso de Jogos Digitais na faculdade Impacta Tecnologia em 2018. Fui responsável pela programação (C# - Unity), modelagem 3D (Blender), game design, efeitos sonoros, roteiro, design de personagens, design de interface, web design, tradução para o inglês, pesquisa e contextualização, GDD, plano de marketing, apresentação, divulgação, pós produção, CD e trailer.",
    "icone": "fa fa-window-restore",
    "youtubeID": "h7fv752nwew",
    "tags": [
      "C#",
      "Blender",
      "Game Design",
      "Sound Design",
      "Level Design",
      "GDD",
      "Plano de Marketing",
      "Trailer"
    ]
  }
]